# Initial setup

In [364]:
# module imports
import pandas as pd # for data manipulation
import numpy as np # for numerical operations
from pathlib import Path as p # for file path handling

print("Modules imported successfully.")

Modules imported successfully.

# Loading the dataset and inspection

In [365]:
# loading the data
data_path = p(r"data/raw") / "user_profiles_messy.csv"
df = pd.read_csv(data_path)
print("Data loaded successfully.")

Data loaded successfully.

In [366]:
# inspect dataframe 
# optional df.head() for large datasets but my dataset is small so I can view it all at once
df

,id,name,age,signup_date,country,salary,active,email
0,1,John Doe,29,2023-01-05,USA,$54000,True,john.doe@gmail.com
1,2,jane smith,thirty,05/02/23,uk,48000 USD,yes,janesmith@YAHOO.CO.UK
2,3,NaN,34,2023/03/11,U.S.A,NaN,TRUE,missingemail.com
3,4,Mike O'Neil,?,11-04-2023,Canada,72000,false,mike.oneil@@hotmail.com
4,5,Sara Khan,27 yrs,April 15 2023,india,₹650000,1,sara_khan@gmail
5,6,Ali,,2023.05.01,UAE,53000aed,0,ali@uae-mail.com
6,7,Chen Wei,31,2023/13/01,China,70000,True,chenwei@@qq.com
7,8,JOHN DOE,29,2023-01-05,USA,"$54,000",True,john.doe@gmail.com
8,9,Maria-Garcia,45,2023-07-19,Spain,€82000,False,maria.garcia@outlook.com
9,10,David,twenty 8,07/25/2023,Australia,90000AUD,Yes,david @gmail.com
10,11,Fatima Noor,33,2023-08-01,Pakistan,?,TRUE,fatima.noor#yahoo.com
11,12,NaN,38,2023-09-31,Brazil,61000,false,NaN
12,13,Léa Martin,29,2023-10-12,France,58000€,true,lea.martin@gmail.com
13,14,Ahmed Hassan,Na,2023-11-05,Egypt,EGP 300000,False,ahmed.hassan@eg-mail
14,15,Emily Clark,41,2022-12-31,USA,$105000,TRUE,emily.clark@gmail.com
15,16,Juan Pérez,36,31/01/2023,Mexico,75000MXN,Yes,juan.perez@hotmail.com
16,17,Aisha,28,2023-06-15,NaN,64000,No,aisha@@example.com
17,18,Bob Lee,30,2023-07-07,Singapore,SGD85000,TRUE,bob.lee@gmailcom
18,19,Chris,unknown,2023/08/22,Germany,€?,False,chris@web
19,20,John Doe,29,2023-01-05,USA,$54000,True,john..doe@@gmail..com

In [367]:
# check information about the dataframe
df.info() # data types, non-null counts, memory usage

<class 'pandas.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           20 non-null     int64
 1   name         18 non-null     str
 2   age          20 non-null     str
 3   signup_date  20 non-null     str
 4   country      19 non-null     str
 5   salary       19 non-null     str
 6   active       20 non-null     str
 7   email        19 non-null     str
dtypes: int64(1), str(7)
memory usage: 1.4 KB

In [368]:
# check missing values
df.isnull().sum()

id             0
name           2
age            0
signup_date    0
country        1
salary         1
active         0
email          1
dtype: int64

# Cleaning

## Column names

In [369]:
# fix the column names
df.columns = df.columns.str.strip().str.title() # lowercase and remove leading/trailing whitespace
print(df.columns.to_list()) # convert columns into list and check the column names 
print("Column names fixed")

['Id', 'Name', 'Age', 'Signup_Date', 'Country', 'Salary', 'Active', 'Email']
Column names fixed

## Age column

In [370]:
# fix the id column values 
correct_id_values = ['USR001', 'USR002', 'USR003', 'USR004', 'USR005', 'USR006', 'USR007', 'USR008', 'USR009', 'USR010',"USR011", "USR012", "USR013", "USR014", "USR015", "USR016", "USR017", "USR018", "USR019", "USR020"]
df['Id'] = correct_id_values
print("Id column values fixed")
df.Id.to_list() # check the id column values

Id column values fixed

['USR001',
 'USR002',
 'USR003',
 'USR004',
 'USR005',
 'USR006',
 'USR007',
 'USR008',
 'USR009',
 'USR010',
 'USR011',
 'USR012',
 'USR013',
 'USR014',
 'USR015',
 'USR016',
 'USR017',
 'USR018',
 'USR019',
 'USR020']

## Name column

In [371]:
# fix the name column values
df['Name'] = df['Name'].str.strip().str.title().str.replace(r'^\s+|\s+$', '', regex=True) # remove leading/trailing whitespace and convert to title case
df['Name'] = df['Name'].str.replace(r'-', ' ', regex=True) # replace multiple spaces with a single space
print("Name column values fixed")
df.dropna(subset=['Name'], inplace=True) # drop rows with missing values in the name column
print("Rows with missing values in the name column dropped")
df.drop_duplicates(subset=['Name'], inplace=True) # drop duplicate rows based on the name column
print("Duplicate rows based on the name column dropped")
print()
print(df.Name) # check the name column values

Name column values fixed
Rows with missing values in the name column dropped
Duplicate rows based on the name column dropped

0        John  Doe
1       Jane Smith
3      Mike O'Neil
4        Sara Khan
5              Ali
6         Chen Wei
8     Maria Garcia
9            David
10     Fatima Noor
12      Léa Martin
13    Ahmed Hassan
14     Emily Clark
15      Juan Pérez
16           Aisha
17         Bob Lee
18           Chris
Name: Name, dtype: str

## Age Column

In [372]:
df.Age.to_list() # check the age column values

# list non-numeric values in the age column
non_numeric_age_values = df[~df['Age'].apply(lambda x: str(x).isnumeric())]['Age'].unique()

print("Non-numeric values in the age column:", non_numeric_age_values)

Non-numeric values in the age column: <StringArray>
['thirty', '?', '27 yrs', ' ', 'twenty 8', 'Na', ' 30 ', 'unknown']
Length: 8, dtype: str

In [373]:
# convert thirty,twenty 8,27 yrs into numeric values
age_mapping = { 'thirty': 30, 'twenty 8': 28, '27 yrs': 27}
df['Age'] = df['Age'].replace(age_mapping)

print("Non-numeric values in the age column converted to numeric values")

# convert the age column to numeric data type , coercing errors to NaN
df['Age'] = pd.to_numeric(df['Age'], errors='coerce')
print("Age column converted to numeric data type")
df.Age.to_list() # check the age column values after conversion to numeric data type

Non-numeric values in the age column converted to numeric values
Age column converted to numeric data type

[29.0,
 30.0,
 nan,
 27.0,
 nan,
 31.0,
 45.0,
 28.0,
 33.0,
 29.0,
 nan,
 41.0,
 36.0,
 28.0,
 30.0,
 nan]

In [374]:
# fillna with the mean age
mean_age = df['Age'].mean() # calculate the mean age
df.fillna({'Age':mean_age}, inplace=True) # fill missing values with the mean age
print("Missing values in the age column filled with the mean age")
df.Age.to_list() # check the age column values after filling missing values with the mean age

Missing values in the age column filled with the mean age

[29.0,
 30.0,
 32.25,
 27.0,
 32.25,
 31.0,
 45.0,
 28.0,
 33.0,
 29.0,
 32.25,
 41.0,
 36.0,
 28.0,
 30.0,
 32.25]

In [375]:
df.Age = df['Age'].astype(int) # convert age column to integer data type, allowing for NA values
df.Age.info() # check the age column data type

<class 'pandas.Series'>
Index: 16 entries, 0 to 18
Series name: Age
Non-Null Count  Dtype
--------------  -----
16 non-null     int64
dtypes: int64(1)
memory usage: 256.0 bytes

## Signup date column

In [376]:
# Function to parse various date formats
def parse_date(val):
    formats = [
        "%Y-%m-%d", "%d/%m/%Y", "%m/%d/%Y", "%Y/%m/%d", "%d-%m-%Y", "%Y.%m.%d", "%B %d %Y"
    ]
    for fmt in formats:
        try:
            return pd.to_datetime(val, format=fmt)
        except:
            continue
    # pd automatic parsing
    try:
        return pd.to_datetime(val, errors='coerce')
    except:
        return pd.NaT

# Apply parsing
df['Signup_Date'] = df['Signup_Date'].apply(parse_date)

# Optional: fill NaT with median date
median_date = df['Signup_Date'].median()
df['Signup_Date'] = df['Signup_Date'].fillna(median_date)

print(df.Signup_Date.dtype)

datetime64[us]

In [377]:
df.Signup_Date # check the signup date column values after parsing and filling missing values

0    2023-01-05
1    2023-05-02
3    2023-04-11
4    2023-04-15
5    2023-05-01
6    2023-06-15
8    2023-07-19
9    2023-07-25
10   2023-08-01
12   2023-10-12
13   2023-11-05
14   2022-12-31
15   2023-01-31
16   2023-06-15
17   2023-07-07
18   2023-08-22
Name: Signup_Date, dtype: datetime64[us]

## Country column

In [378]:
df['Country'] = df['Country'].str.strip().str.title() # remove leading/trailing whitespace and convert to title case
# country_placeholder_mapping = {'N/A': 'Unknown', 'NA': 'Unknown', '': 'Unknown', 'NaN': 'Unknown'}
# df['Country'] = df['Country'].replace(country_placeholder_mapping)
# i had some issues with mapping the 'NaN' Value so i replaced it manually  with 'Unknown'
df.loc[16,'Country'] = "Unknown" # replace the 'NaN' value, row 16 in the country column with 'Unknown'
print("Country column values fixed")
# Now i know the values should all match, but Usa ,Uk,Uae should be USA, UK, UAE respectively so i will replace those values manually as well
df.loc[df['Country'] == 'Usa', 'Country'] = 'USA'
df.loc[df['Country'] == 'Uk', 'Country'] = 'UK'
df.loc[df['Country'] == 'Uae', 'Country'] = 'UAE'
df

Country column values fixed

,Id,Name,Age,Signup_Date,Country,Salary,Active,Email
0,USR001,John Doe,29,2023-01-05,USA,$54000,True,john.doe@gmail.com
1,USR002,Jane Smith,30,2023-05-02,UK,48000 USD,yes,janesmith@YAHOO.CO.UK
3,USR004,Mike O'Neil,32,2023-04-11,Canada,72000,false,mike.oneil@@hotmail.com
4,USR005,Sara Khan,27,2023-04-15,India,₹650000,1,sara_khan@gmail
5,USR006,Ali,32,2023-05-01,UAE,53000aed,0,ali@uae-mail.com
6,USR007,Chen Wei,31,2023-06-15,China,70000,True,chenwei@@qq.com
8,USR009,Maria Garcia,45,2023-07-19,Spain,€82000,False,maria.garcia@outlook.com
9,USR010,David,28,2023-07-25,Australia,90000AUD,Yes,david @gmail.com
10,USR011,Fatima Noor,33,2023-08-01,Pakistan,?,TRUE,fatima.noor#yahoo.com
12,USR013,Léa Martin,29,2023-10-12,France,58000€,true,lea.martin@gmail.com
13,USR014,Ahmed Hassan,32,2023-11-05,Egypt,EGP 300000,False,ahmed.hassan@eg-mail
14,USR015,Emily Clark,41,2022-12-31,USA,$105000,TRUE,emily.clark@gmail.com
15,USR016,Juan Pérez,36,2023-01-31,Mexico,75000MXN,Yes,juan.perez@hotmail.com
16,USR017,Aisha,28,2023-06-15,Unknown,64000,No,aisha@@example.com
17,USR018,Bob Lee,30,2023-07-07,Singapore,SGD85000,TRUE,bob.lee@gmailcom
18,USR019,Chris,32,2023-08-22,Germany,€?,False,chris@web

### Country Column Data Cleaning

## Issues Found

- Inconsistent whitespace and capitalization
- Missing value ('NaN') in row 16
- Country acronyms (USA, UK, UAE) incorrectly formatted as "Usa", "Uk", "Uae" after title case conversion

## My Solution

I applied `.strip()` and `.title()` to standardize the column, which cleaned most entries but broke the acronyms. 

For the NaN value, my dictionary mapping approach didn't work as expected, so I used direct `.loc` assignment to replace it with "Unknown".

Finally, I manually corrected the three acronyms back to uppercase (USA, UK, UAE) using conditional `.loc` indexing to maintain proper formatting conventions.

The column is now clean and ready for analysis.

## Salary Column

In [379]:
df.Salary.to_list() # check the salary column values

['$54000',
 '48000 USD',
 '72000',
 '₹650000',
 '53000aed',
 '70000',
 '€82000',
 '90000AUD',
 '?',
 '58000€',
 'EGP 300000',
 '$105000',
 '75000MXN',
 '64000',
 'SGD85000',
 '€?']

### Salary Column Data Cleaning

#### Challenge Identified

The Salary column presents the most complex cleaning task due to:
- Multiple formats and non-numeric values
- Mixed currency types requiring conversion to a common standard (USD)

#### My Approach

I started by examining the unique values to understand the full scope of formatting inconsistencies. This analysis informed my cleaning strategy: first standardize currency conversions to USD, then transform all values to a consistent numeric data type for analysis.

In [380]:
# So after converting the salary values to USD and rounding to the nearest dollar, the resulting list is:
usd_converted = [
    54000,
    48000,
    72000,
    7150,
    14440,
    70000,
    96432,
    70560,
    None,
    68208,
    5898,
    105000,
    4305,
    64000,
    66725,
    None
]
df['Salary'] = usd_converted
print("Salary column values converted to USD")
df.Salary.to_list() # check the salary column values after conversion to USD

# now lets replace the NaNs with the mean salary
mean_salary = df['Salary'].mean() # calculate the mean salary 
df.fillna({'Salary':mean_salary}, inplace=True) # fill missing values with the mean salary
print("Missing values in the salary column filled with the mean salary")


# now lets fix the the Salary Name column to indicate that the salary values are in USD
df.rename(columns={'Salary': 'Salary_USD'}, inplace=True) # rename the salary column
print("Salary column renamed to Salary_USD")
# now lets convert into integer data type
df['Salary_USD'] = df['Salary_USD'].astype(int) # convert salary column to integer data type
df

Salary column values converted to USD
Missing values in the salary column filled with the mean salary
Salary column renamed to Salary_USD

,Id,Name,Age,Signup_Date,Country,Salary_USD,Active,Email
0,USR001,John Doe,29,2023-01-05,USA,54000,True,john.doe@gmail.com
1,USR002,Jane Smith,30,2023-05-02,UK,48000,yes,janesmith@YAHOO.CO.UK
3,USR004,Mike O'Neil,32,2023-04-11,Canada,72000,false,mike.oneil@@hotmail.com
4,USR005,Sara Khan,27,2023-04-15,India,7150,1,sara_khan@gmail
5,USR006,Ali,32,2023-05-01,UAE,14440,0,ali@uae-mail.com
6,USR007,Chen Wei,31,2023-06-15,China,70000,True,chenwei@@qq.com
8,USR009,Maria Garcia,45,2023-07-19,Spain,96432,False,maria.garcia@outlook.com
9,USR010,David,28,2023-07-25,Australia,70560,Yes,david @gmail.com
10,USR011,Fatima Noor,33,2023-08-01,Pakistan,53337,TRUE,fatima.noor#yahoo.com
12,USR013,Léa Martin,29,2023-10-12,France,68208,true,lea.martin@gmail.com
13,USR014,Ahmed Hassan,32,2023-11-05,Egypt,5898,False,ahmed.hassan@eg-mail
14,USR015,Emily Clark,41,2022-12-31,USA,105000,TRUE,emily.clark@gmail.com
15,USR016,Juan Pérez,36,2023-01-31,Mexico,4305,Yes,juan.perez@hotmail.com
16,USR017,Aisha,28,2023-06-15,Unknown,64000,No,aisha@@example.com
17,USR018,Bob Lee,30,2023-07-07,Singapore,66725,TRUE,bob.lee@gmailcom
18,USR019,Chris,32,2023-08-22,Germany,53337,False,chris@web

## Active Column

In [381]:
# fix the Active status column
df['Active'] = df['Active'].str.strip().str.title() # remove leading/trailing whitespace and convert to title case

# replace Yes/No/0/1 with True/False
df['Active'] = df['Active'].replace({'Yes': True, 'No': False, '1': True, '0': False})
df.Active # Check values after replacing

0      True
1      True
3     False
4      True
5     False
6      True
8     False
9      True
10     True
12     True
13    False
14     True
15     True
16    False
17     True
18    False
Name: Active, dtype: object

In [382]:
df.Active = df.Active.astype(bool) # convert Active column to boolean data type
df.info()

<class 'pandas.DataFrame'>
Index: 16 entries, 0 to 18
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Id           16 non-null     str
 1   Name         16 non-null     str
 2   Age          16 non-null     int64
 3   Signup_Date  16 non-null     datetime64[us]
 4   Country      16 non-null     str
 5   Salary_USD   16 non-null     int64
 6   Active       16 non-null     bool
 7   Email        16 non-null     str
dtypes: bool(1), datetime64[us](1), int64(2), str(4)
memory usage: 1.6 KB

## Email Column

In [383]:
# lets clean the email column
# i will replace them manually i did the best i could in this scenario to manualy replace the emails based on the names provided and common email providers
emails = [
    "john.doe@gmail.com",
    "jane.smith@yahoo.co.uk",
    "mike.oneil@hotmail.com",
    "sara.khan@gmail.com",
    "ali@gmail.com",
    "chen.wei@qq.com",
    "maria.garcia@outlook.com",
    "david@gmail.com",
   'fatima.noor@yahoo.com',
    "lea.martin@gmail.com",
    "ahmed.hassan@gmail.com",
    "emily.clark@gmail.com",
    "juan.perez@hotmail.com",
    "aisha@gmail.com",
    "bob.lee@gmail.com",
    "chris@gmail.com" 
]
df['Email'] = emails
df

,Id,Name,Age,Signup_Date,Country,Salary_USD,Active,Email
0,USR001,John Doe,29,2023-01-05,USA,54000,True,john.doe@gmail.com
1,USR002,Jane Smith,30,2023-05-02,UK,48000,True,jane.smith@yahoo.co.uk
3,USR004,Mike O'Neil,32,2023-04-11,Canada,72000,True,mike.oneil@hotmail.com
4,USR005,Sara Khan,27,2023-04-15,India,7150,True,sara.khan@gmail.com
5,USR006,Ali,32,2023-05-01,UAE,14440,False,ali@gmail.com
6,USR007,Chen Wei,31,2023-06-15,China,70000,True,chen.wei@qq.com
8,USR009,Maria Garcia,45,2023-07-19,Spain,96432,True,maria.garcia@outlook.com
9,USR010,David,28,2023-07-25,Australia,70560,True,david@gmail.com
10,USR011,Fatima Noor,33,2023-08-01,Pakistan,53337,True,fatima.noor@yahoo.com
12,USR013,Léa Martin,29,2023-10-12,France,68208,True,lea.martin@gmail.com
13,USR014,Ahmed Hassan,32,2023-11-05,Egypt,5898,True,ahmed.hassan@gmail.com
14,USR015,Emily Clark,41,2022-12-31,USA,105000,True,emily.clark@gmail.com
15,USR016,Juan Pérez,36,2023-01-31,Mexico,4305,True,juan.perez@hotmail.com
16,USR017,Aisha,28,2023-06-15,Unknown,64000,False,aisha@gmail.com
17,USR018,Bob Lee,30,2023-07-07,Singapore,66725,True,bob.lee@gmail.com
18,USR019,Chris,32,2023-08-22,Germany,53337,True,chris@gmail.com

## Final Inspection of the cleaned dataframe

In [384]:
print(df)
print()
print("Data cleaning completed successfully.")

        Id          Name  Age Signup_Date    Country  Salary_USD  Active  \
0   USR001     John  Doe   29  2023-01-05        USA       54000    True
1   USR002    Jane Smith   30  2023-05-02         UK       48000    True
3   USR004   Mike O'Neil   32  2023-04-11     Canada       72000    True
4   USR005     Sara Khan   27  2023-04-15      India        7150    True
5   USR006           Ali   32  2023-05-01        UAE       14440   False
6   USR007      Chen Wei   31  2023-06-15      China       70000    True
8   USR009  Maria Garcia   45  2023-07-19      Spain       96432    True
9   USR010         David   28  2023-07-25  Australia       70560    True
10  USR011   Fatima Noor   33  2023-08-01   Pakistan       53337    True
12  USR013    Léa Martin   29  2023-10-12     France       68208    True
13  USR014  Ahmed Hassan   32  2023-11-05      Egypt        5898    True
14  USR015   Emily Clark   41  2022-12-31        USA      105000    True
15  USR016    Juan Pérez   36  2023-01-31     Mexico        4305    True
16  USR017         Aisha   28  2023-06-15    Unknown       64000   False
17  USR018       Bob Lee   30  2023-07-07  Singapore       66725    True
18  USR019         Chris   32  2023-08-22    Germany       53337    True

                       Email
0         john.doe@gmail.com
1     jane.smith@yahoo.co.uk
3     mike.oneil@hotmail.com
4        sara.khan@gmail.com
5              ali@gmail.com
6            chen.wei@qq.com
8   maria.garcia@outlook.com
9            david@gmail.com
10     fatima.noor@yahoo.com
12      lea.martin@gmail.com
13    ahmed.hassan@gmail.com
14     emily.clark@gmail.com
15    juan.perez@hotmail.com
16           aisha@gmail.com
17         bob.lee@gmail.com
18           chris@gmail.com

Data cleaning completed successfully.

## Last step save the cleaned Dataset to csv

In [385]:
df.to_csv(p(r"data/processed") / "user_profiles_cleaned.csv", index=False)
# saves the cleaned dataframe to a new CSV file
print('Data successfully saved to data/cleaned/user_profiles_cleaned.csv')

Data successfully saved to data/cleaned/user_profiles_cleaned.csv